Revit 2026 API

# ReferenceUVPoint Property

---

The UV parameters of the reference, if the reference contains a face.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public UV UVPoint { get; }
```
```vb
Public ReadOnly Property UVPoint As UV
	Get
```
```cpp
public:
property UV^ UVPoint {
	UV^ get ();
}
```
```fsharp
member UVPoint : UV with get
```

#### Property Value

UV

This value is valid only for references of type REFERENCE_TYPE_SURFACE. It is  for all other types.

#### Reference

Reference Class

Autodesk.Revit.DB Namespace